_Rarzrabotki/Rarus/USO2/Documents/уатВыбытиеТСиОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>уатВыбытиеТСиОборудования</Name>
			<Comment>Выбытие ТС и оборудования (уат)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.уатМестонахождениеТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Comment>Транспортное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыбытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/уатВыбытиеТСиОборудования/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем таблТССсылка; // Хранит таблицу ТС, которая заполняется при инициализации документа из таблицы ТС
// по ссылке. Если при редактировании таблицы ТС она будет изменена, то все старые ТС при перепроведении
// должны возвратиться в исходное (до даты документа) местонахождение


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ЗаписатьРеквизитыТСиОборудования(Отказ)
	Для Каждого СтрТС Из ТС Цикл
		ТСОбъект = СтрТС.ТС.ПолучитьОбъект();
		ТСОбъект.уатДатаВыбытия = СтрТС.ДатаВыбытия;
		
		ТСОбъект.уатОрганизация = Неопределено;
		ТСОбъект.уатПодразделение = Неопределено;
		ТСОбъект.уатКолонна = Неопределено;
		
		Попытка 
			ТСОбъект.Записать();
		Исключение
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке("Не удалось записать ТС / оборудование """ + Строка(СтрТС.ТС) + """", Отказ);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ВосстановитьТСиОборудованиеДоВыбытия(Отказ)
	Для Каждого СтрТС Из ТС Цикл
		ТСОбъект = СтрТС.ТС.ПолучитьОбъект();
		ТСОбъект.уатДатаВыбытия = '00010101';
		
		МестоТС = уатОбщегоНазначения.МестонахождениеТС(СтрТС.ТС, СтрТС.ДатаВыбытия - 1);
		
		ТСОбъект.уатОрганизация = МестоТС.Организация;
		ТСОбъект.уатПодразделение = МестоТС.Подразделение;
		ТСОбъект.уатКолонна = МестоТС.Колонна;
		
		Попытка 
			ТСОбъект.Записать();
		Исключение
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке("Не удалось записать ТС / оборудование """ + Строка(СтрТС.ТС) + """", Отказ);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ВосстановитьТСиОборудованиеПередЗаписью(Отказ)
	Для Каждого ТекТС Из таблТССсылка Цикл
		ТСОбъект = ТекТС.ТС.ПолучитьОбъект();
		ТСОбъект.уатДатаВыбытия = '00010101';
		
		МестоТС = уатОбщегоНазначения.МестонахождениеТС(ТекТС.ТС, ТекТС.ДатаВыбытия - 1);
		
		ТСОбъект.уатОрганизация = МестоТС.Организация;
		ТСОбъект.уатПодразделение = МестоТС.Подразделение;
		ТСОбъект.уатКолонна = МестоТС.Колонна;
		
		Попытка 
			ТСОбъект.Записать();
		Исключение
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке("Не удалось записать ТС / оборудование """ + Строка(ТекТС.ТС) + """", Отказ);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ТСВведеныВЭксплуатацию(Отказ)
	Рез = Истина;
	
	Для Каждого ТекСтрока Из ТС Цикл
		Если ТекСтрока.ТС.уатДатаВводаВЭксплуатацию = '00010101' ИЛИ ТекСтрока.ДатаВыбытия < ТекСтрока.ТС.уатДатаВводаВЭксплуатацию Тогда
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке("ТС / оборудование """ + Строка(ТекСтрока.ТС) + """ не введено в эксплуатацию!", Отказ);
			Рез = Ложь;
		ИначеЕсли ТекСтрока.ТС.уатДатаВыбытия <> '00010101' И ТекСтрока.ДатаВыбытия > ТекСтрока.ТС.уатДатаВыбытия Тогда
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке("ТС / оборудование """ + Строка(ТекСтрока.ТС) + """ выбыло из эксплуатации (дата выбытия: " + Формат(ТекСтрока.ТС.уатДатаВыбытия, "ДФ = дд.ММ.гггг") + ")!", Отказ);
			Рез = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;
КонецФункции

Функция ТССоответствуютМестонахождению(Отказ)
	Рез = Истина;
	
	Для Каждого ТекСтрока Из ТС Цикл
		МестоТС = уатОбщегоНазначения.МестонахождениеТС(ТекСтрока.ТС, ТекСтрока.ДатаВыбытия - 1);
		Если МестоТС.Организация <> Организация Тогда
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке("Местонахождение ТС / оборудования """ + Строка(ТекСтрока.ТС)
				+ """ не соответствует местонахождению по документу!", Отказ);
			Рез = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;
КонецФункции


//////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.уатВыбытиеТСиОборудования.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	уатПроведение_проф.ОтразитьМестонахождениеТС(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.уатВыбытиеТСиОборудования.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	// Запись даты ввода в карточках ТС и оборудования
	ЗаписатьРеквизитыТСиОборудования(Отказ);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	//Проверка согласования документа
	Если (НЕ Отказ) И РежимЗаписи = РежимЗаписиДокумента.Проведение И ТребуетСогласования И (НЕ уатОбщегоНазначения_проф.ДокументСогласован(Ссылка)) Тогда
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке("Документ """ + Ссылка + """ необходимо согласовать!", Отказ);
		Возврат;
	КонецЕсли;
	
	// Проверка на то, что все ТС и оборудование введены в эксплуатацию
	Если (НЕ Отказ) И РежимЗаписи = РежимЗаписиДокумента.Проведение И (НЕ ТСВведеныВЭксплуатацию(Отказ)) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка на то, что местонахождение ТС и оборудования
	//соответствует реквизитам шапки документа (если они указаны)
	Если (НЕ Отказ) И РежимЗаписи = РежимЗаписиДокумента.Проведение И (НЕ  ТССоответствуютМестонахождению(Отказ)) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВосстановитьТСиОборудованиеПередЗаписью(Отказ);
	КонецЕсли;
	
	МассивТС = Новый Массив();
	Для Каждого ТекСтрока Из ТС Цикл 
		Если МассивТС.Найти(ТекСтрока.ТС) = Неопределено Тогда 
			МассивТС.Добавить(ТекСтрока.ТС);
		КонецЕсли;
	КонецЦикла;
	
	СписокТС = "";
	Для Каждого ТекТС Из МассивТС Цикл 
		СписокТС = СписокТС + ?(СписокТС = "", "", ", ") + ТекТС.Наименование;
	КонецЦикла;
КонецПроцедуры // ПередЗаписью

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		таблТССсылка = Ссылка.ТС.Выгрузить();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		// Заголовок для сообщений об ошибках проведения.
		Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
		
		СтруктураПолей = Новый Структура("Организация, Ответственный");
		уатОбщегоНазначенияТиповые.уатПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураПолей, Отказ, Заголовок);
		СтруктураПолей = Новый Структура("ТС, ДатаВыбытия");
		уатОбщегоНазначенияТиповые.уатПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ТС", СтруктураПолей, Отказ, Заголовок);
		
		//проверка на дубли строк
		тблТС = ТС.Выгрузить().Скопировать();
		тблТС.Свернуть("ТС");
		Если тблТС.Количество() < ТС.Количество() Тогда
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке("В табличной части ""ТС"" присутствуют повторяющиеся строки (дублирование ТС)!", Отказ, Заголовок);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВосстановитьТСиОборудованиеДоВыбытия(Отказ);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

таблТССсылка = Ссылка.ТС.Выгрузить();
